Revit 2027 API
IUpdater.GetUpdaterId Method
 Returns globally unique updater id - used to identify the Updater Called once during registration of the updater
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
UpdaterId GetUpdaterId()
Function GetUpdaterId As UpdaterId
UpdaterId^ GetUpdaterId()
abstract GetUpdaterId : unit -> UpdaterId
Return Value
UpdaterId
See Also
Reference
IUpdater Interface
Autodesk.Revit.DB Namespace